In [1]:
# imports
import pandas as pd

In [2]:
# reading the csv into a dataframe
df = pd.read_csv('data/data.csv', sep=';', header=0, index_col=False)

In [3]:
# overview (datatypes/null values)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225 entries, 0 to 224
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Datum       222 non-null    object
 1   Unnamed: 1  222 non-null    object
 2   Betrag      222 non-null    object
 3   Unnamed: 3  0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 7.2+ KB

In [4]:
display(df)

          Datum         Unnamed: 1   Betrag  Unnamed: 3
0    30.12.2019             Gehalt  2264,37         NaN
1    30.12.2019     Altersvorsorge   -50,00         NaN
2    01.01.2020              Miete  -822,28         NaN
3    01.01.2020             Klarna   -15,99         NaN
4    02.01.2020  Bargeldauszahlung   -22,00         NaN
..          ...                ...      ...         ...
220  30.12.2020     Altersvorsorge   -50,00         NaN
221  31.12.2020  Bargeldauszahlung   -13,00         NaN
222         NaN                NaN      NaN         NaN
223         NaN                NaN      NaN         NaN
224         NaN                NaN      NaN         NaN

[225 rows x 4 columns]

In [5]:
# delete 4th column
df = df.drop('Unnamed: 3', axis=1)

In [6]:
# rename columns
df = df.rename(columns={'Datum': 'date', 'Unnamed: 1': 'description', 'Betrag': 'value'})

In [7]:
df.columns

Index(['date', 'description', 'value'], dtype='object')

In [8]:
# remove last 3 empty rows
df = df.drop(index=[222,223,224])

In [9]:
df.tail(3)

           date        description   value
219  30.12.2020             Zinsen  100,00
220  30.12.2020     Altersvorsorge  -50,00
221  31.12.2020  Bargeldauszahlung  -13,00

In [10]:
# convert 'value' column string values to floats
df.value = df.value.str.replace(',', '.')
df.value = df.value.astype(float)

In [11]:
# modify date string
df.date = df.date.str.split('.').str[2] + '-' + df.date.str.split('.').str[1] + '-' + df.date.str.split('.').str[0]

In [12]:
df.head(3)

         date     description    value
0  2019-12-30          Gehalt  2264.37
1  2019-12-30  Altersvorsorge   -50.00
2  2020-01-01           Miete  -822.28

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222 entries, 0 to 221
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         222 non-null    object
 1   description  222 non-null    object
 2   value        222 non-null    float64
dtypes: float64(1), object(2)
memory usage: 5.3+ KB

In [14]:
# check length of date string
df.date.str.len().unique()

array([10,  6], dtype=int64)

In [15]:
# display rows where date has not 10 characters 
df[df.date.str.len()!=10]

       date description   value
165  -10-01       Miete -822.28

In [16]:
# add missing year
df.loc[165:165, 'date'] = '2020' + df.loc[165:165, 'date']

In [17]:
df[165:166]

           date description   value
165  2020-10-01       Miete -822.28

In [18]:
# convert 'date' string values to date
df.date = pd.to_datetime(df.date)

In [19]:
df.head(3)

        date     description    value
0 2019-12-30          Gehalt  2264.37
1 2019-12-30  Altersvorsorge   -50.00
2 2020-01-01           Miete  -822.28

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222 entries, 0 to 221
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         222 non-null    datetime64[ns]
 1   description  222 non-null    object
 2   value        222 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 5.3+ KB

In [21]:
# sum of deposits by type
df[df.value > 0].groupby('description').value.sum()

description
Bargeldeinzahlung                  350.00
Gehalt                           30435.93
Kreditkarte                         20.00
Paypal                             250.01
Strom Nachzahlung/Überzahlung      122.83
Zinsen                             100.00
Name: value, dtype: float64

In [22]:
# count of deposits by type
df[df.value > 0].groupby('description').description.count()

description
Bargeldeinzahlung                 1
Gehalt                           13
Kreditkarte                       1
Paypal                            3
Strom Nachzahlung/Überzahlung     1
Zinsen                            1
Name: description, dtype: int64

In [23]:
# count of zero values
df[df.value == 0].groupby('description').value.sum()

Series([], Name: value, dtype: float64)

In [24]:
# count of withdrawals by type
df[df.value < 0].groupby('description').description.count()

description
Altersvorsorge                     13
Apple Care                          1
Apple Pay                          30
Apple sagt Danke                    1
Autofinanzierung                   12
Autowäschedienst                    1
Bargeldauszahlung                  13
DSL                                11
DSL 1&1                             1
Einrichtungsgeschäft                1
Kaufhof                             2
Klarna                              3
Kreditkarte                        10
Mediamarkt                          1
Miete                              12
Miete Nachbuchung                   1
Nebenabrechnung Mietnebenkosten     1
Netflix                            11
Paypal                             22
Sky                                 6
Strom                              12
Supermarkt                         31
Versicherung                        4
Zeitschriftenabo                    1
Zwilling                            1
Name: description, dtype: int64

In [25]:
df.query('description == "DSL" or description == "DSL 1&1"')

          date description  value
19  2020-01-26         DSL -30.99
33  2020-02-25         DSL -30.99
48  2020-03-26         DSL -30.99
66  2020-04-25         DSL -30.99
87  2020-05-25         DSL -30.99
106 2020-06-24         DSL -30.99
131 2020-07-24         DSL -34.99
146 2020-08-23         DSL -34.99
159 2020-09-22         DSL -34.99
181 2020-10-25     DSL 1&1 -34.99
198 2020-11-24         DSL -34.99
214 2020-12-21         DSL -34.99

In [26]:
df.loc[181:181, 'description'] = 'DSL'

In [27]:
df[181:182]

          date description  value
181 2020-10-25         DSL -34.99

In [28]:
df.head(3)

        date     description    value
0 2019-12-30          Gehalt  2264.37
1 2019-12-30  Altersvorsorge   -50.00
2 2020-01-01           Miete  -822.28

In [29]:
#remove 13th Gehalt and Altersvorsorge of 2019
df = df.drop(index=[0,1])
df.reset_index(drop=True, inplace=True)

In [30]:
df.head(3)

        date        description   value
0 2020-01-01              Miete -822.28
1 2020-01-01             Klarna  -15.99
2 2020-01-02  Bargeldauszahlung  -22.00

In [31]:
# sum of expenses by description
df[df.value < 0].groupby('description').value.sum().sort_values(ascending=True)

description
Miete                             -9924.24
Paypal                            -5152.38
Autofinanzierung                  -3000.00
Kreditkarte                       -2950.00
Bargeldauszahlung                 -2164.00
Supermarkt                        -1728.01
Apple Pay                         -1338.00
Apple sagt Danke                   -899.00
Strom                              -624.00
Altersvorsorge                     -600.00
Nebenabrechnung Mietnebenkosten    -500.00
DSL                                -395.88
Zwilling                           -392.44
Klarna                             -180.30
Kaufhof                            -143.94
Netflix                            -109.89
Versicherung                       -103.96
Apple Care                          -99.00
Einrichtungsgeschäft                -94.67
Sky                                 -77.94
Mediamarkt                          -22.28
Miete Nachbuchung                   -20.52
Autowäschedienst                    -12.99
Zeitschriftenabo                     -9.99
Name: value, dtype: float64

In [32]:
# monthly sum of withdrawals
df[df.value < 0].resample(rule='M', on='date')['value'].sum()

date
2020-01-31   -1998.15
2020-02-29   -1718.43
2020-03-31   -1666.54
2020-04-30   -2677.67
2020-05-31   -1652.12
2020-06-30   -2572.75
2020-07-31   -5427.29
2020-08-31   -2448.78
2020-09-30   -1615.11
2020-10-31   -2070.41
2020-11-30   -3740.44
2020-12-31   -2955.74
Freq: M, Name: value, dtype: float64

In [33]:
# monthly sum of deposits
df[df.value > 0].resample(rule='M', on='date')['value'].sum()

date
2020-01-31    2364.37
2020-02-29    2264.38
2020-03-31    2264.37
2020-04-30    2414.37
2020-05-31    2264.37
2020-06-30    2387.20
2020-07-31    2264.37
2020-08-31    2264.37
2020-09-30    2514.15
2020-10-31    2514.15
2020-11-30    2534.15
2020-12-31    2964.15
Freq: M, Name: value, dtype: float64

In [34]:
# total deposits
df[df.value > 0].value.sum()

29014.4

In [35]:
# total withdrawals
df[df.value < 0].value.sum()

-30543.43

In [36]:
# year's total balance
x = df[df.value > 0].value.sum() + df[df.value < 0].value.sum()
print(x.round(2))

-1529.03

In [37]:
# exporting to csv
from os.path import expanduser
from pathlib import Path

def get_name(variable):
    for name in globals():
        if id(globals()[name]) == id(variable):
            return name
    for name in locals():
        if id(locals()[name]) == id(variable):
            return name
    return None

def save(df):
    """Saves a dataframe to the Downloads folder"""
    home = Path(expanduser("~"))
    path = home / "Downloads"
    df_name = get_name(df) + ".csv"
    file_name = path / df_name
    df.to_csv(file_name, index=False)
    # print(file_name)

In [38]:
#save(df)

In [39]:
df.shape

(220, 3)

In [40]:
from sql_functions import get_engine
import psycopg2

In [45]:
schema = 'public' 
engine = get_engine()

In [47]:
#print(engine)

In [46]:
table_name = 'output_01'
if engine!=None:
    try:
        df.to_sql(name=table_name, 
                        con=engine, 
                        if_exists='replace', 
                        schema=schema, 
                        index=False, 
                        chunksize=5000, 
                        method='multi') 
        print(f"The {table_name} table was exported successfully.")
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        engine = None

The output_01 table was exported successfully.